Австралия/src/InformationRegisters/PredeterminedOverheadRates/PredeterminedOverheadRates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>PredeterminedOverheadRates</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Rate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>OverheadsGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Owner</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
      <types>CatalogRef.Companies</types>
      <types>CatalogRef.CostPools</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CostDriver</name>
    <type>
      <types>CatalogRef.CostDrivers</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/AccountingPolicy/AccountingPolicy.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AccountingPolicy</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>RegisteredForVAT</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PostVATEntriesBySourceDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PostAdvancePaymentsBySourceDocuments</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>IssueAutomaticallyAgainstSales</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>DefaultVATRate</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </resources>
  <resources>
    <name>CashMethodOfAccounting</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InventoryValuationMethod</name>
    <type>
      <types>EnumRef.InventoryValuationMethods</types>
    </type>
  </resources>
  <resources>
    <name>UseGoodsReturnFromCustomer</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UseGoodsReturnToSupplier</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>StockTransactionsMethodology</name>
    <type>
      <types>EnumRef.StockTransactionsMethodology</types>
    </type>
  </resources>
  <resources>
    <name>PostExpensesByWorkOrder</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ManufacturingOverheadsAllocationMethod</name>
    <type>
      <types>EnumRef.ManufacturingOverheadsAllocationMethods</types>
    </type>
  </resources>
  <resources>
    <name>InvoiceTotalDue</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>AccountBalance</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>Overdue</name>
    <type>
      <types>EnumRef.UseOfOptionalPrintSections</types>
    </type>
  </resources>
  <resources>
    <name>VATRoundingRule</name>
    <type>
      <types>EnumRef.VATRoundingRules</types>
    </type>
  </resources>
  <resources>
    <name>RegisteredForSalesTax</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>UnderOverAllocatedOverheadsSetting</name>
    <type>
      <types>EnumRef.UnderOverAllocatedOverheadsSettings</types>
    </type>
  </resources>
  <resources>
    <name>RegisterDeliveryDateInInvoices</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>InventoryDispatchingStrategy</name>
    <type>
      <types>EnumRef.InventoryDispatchingStrategy</types>
    </type>
  </resources>
  <resources>
    <name>AccountingPrice</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </resources>
  <resources>
    <name>UseTemplates</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>RegisterAccountingEntries</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/Enums/ManufacturingOverheadsAllocationMethods/ManufacturingOverheadsAllocationMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ManufacturingOverheadsAllocationMethods</name>
  <enumValues>
    <name>PlantwideAllocation</name>
  </enumValues>
  <enumValues>
    <name>DepartmentalAllocation</name>
  </enumValues>
  <enumValues>
    <name>ActivityBasedCosting</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/BusinessUnits/BusinessUnits.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BusinessUnits</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>GoodsInTransit</name>
      <description>Goods in transit</description>
    </items>
    <items>
      <name>MainDepartment</name>
      <description>Main department</description>
    </items>
    <items>
      <name>MainWarehouse</name>
      <description>Main warehouse</description>
    </items>
    <items>
      <name>DropShipping</name>
      <description>Drop shipping</description>
    </items>
  </predefined>
  <attributes>
    <name>StructuralUnitType</name>
    <type>
      <types>EnumRef.BusinessUnitsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>FRP</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>RetailPriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountInRetail</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>MarkupGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>RecipientOfWastes</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>DisposalsRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationSource</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationRecipient</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningInterval</name>
    <type>
      <types>EnumRef.PlanningIntervals</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningIntervalDuration</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldsValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>State</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EMAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KindForList</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/InformationRegisters/PredeterminedOverheadRates/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

Function GetPredeterminedOverheadRate(Val Date = Undefined, Val Owner, Val CostDriver) Export
	
	StructureToReturn = New Structure;
	StructureToReturn.Insert("OverheadsGLAccount",	Undefined);
	StructureToReturn.Insert("Rate",				0);
		
	If NOT ValueIsFilled(Date) Then
		Date = CurrentSessionDate();
	EndIf;
	
	Query = New Query;
	Query.Text =
	"SELECT ALLOWED
	|	PredeterminedOverheadRatesSliceLast.OverheadsGLAccount AS OverheadsGLAccount,
	|	PredeterminedOverheadRatesSliceLast.Rate AS Rate
	|FROM
	|	InformationRegister.PredeterminedOverheadRates.SliceLast(
	|			&Date,
	|			Owner = &Owner
	|				AND CostDriver = &CostDriver) AS PredeterminedOverheadRatesSliceLast";
	Query.SetParameter("Date",			Date);
	Query.SetParameter("Owner",			Owner);
	Query.SetParameter("CostDriver",	CostDriver);
	
	Selection = Query.Execute().Select();
	
	If Selection.Next() Then
		FillPropertyValues(StructureToReturn, Selection);
	Else
		CommonClientServer.MessageToUser(StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en = 'Please specify Predetermined overhead rate actual on %1 for %2 and %3.'; ru = 'Укажите Предустановленную ставку накладных расходов на %1 для %2 и %3.';pl = 'Określ Przewidzianą rzeczywistą stawkę kosztów ogólnych rzeczywistą na %1 dla %2 i %3.';es_ES = 'Por favor, especifique la tasa de recargo predeterminada real %1para %2, %3.';es_CO = 'Por favor, especifique la tasa de recargo predeterminada real %1para %2, %3.';tr = 'Lütfen, %2 ve %3 için %1''de gerçek önceden belirlenmiş genel gider oranını belirtin.';it = 'Specificare i Costi orari generali predeterminati effettivi in %1 per %2 e %3.';de = 'Bitte geben Sie den vorgegebenen Ist-Gemeinkostenzuschlag gültig zum %1 für %2und %3 an.'"),
			Format(Date, "DLF=D"),
			Owner,
			CostDriver));
	EndIf;
	
	Return StructureToReturn;

EndFunction

Function GetActivityOverheadRate(Activity, Date, Company, BusinessUnit) Export
	
	Activities = New Array;
	Activities.Add(Activity);
	OverheadRates = GetActivitiesOverheadRates(Activities, Date, Company, BusinessUnit);
	Return OverheadRates.Total("Rate");
	
EndFunction

Function GetActivitiesOverheadRates(Activities, Date, Company, BusinessUnit) Export
	
	Query = New Query;
	
	Query.Text =
	"SELECT
	|	ManufacturingActivities.Ref AS Activity,
	|	ManufacturingActivities.CostPool AS CostPool
	|INTO TT_Activities
	|FROM
	|	Catalog.ManufacturingActivities AS ManufacturingActivities
	|WHERE
	|	ManufacturingActivities.Ref IN (&Activities)";
	
	DriveClientServer.AddDelimeter(Query.Text);
	Query.Text = Query.Text + GetActivitiesOverheadRatesQueryText();
	
	DriveClientServer.AddDelimeter(Query.Text);
	Query.Text = Query.Text +
	"SELECT
	|	TT_ActivitiesOverheadRates.Activity AS Activity,
	|	TT_ActivitiesOverheadRates.OverheadsGLAccount AS OverheadsGLAccount,
	|	TT_ActivitiesOverheadRates.BusinessUnit AS BusinessUnit,
	|	TT_ActivitiesOverheadRates.Rate AS Rate
	|FROM
	|	TT_ActivitiesOverheadRates AS TT_ActivitiesOverheadRates";
	
	Query.SetParameter("Activities",	Activities);
	Query.SetParameter("Date",			Date);
	Query.SetParameter("Company",		Company);
	Query.SetParameter("BusinessUnit",	BusinessUnit);
	
	Return Query.Execute().Unload();
	
EndFunction

Function GetActivitiesOverheadRatesQueryText() Export
	
	Return
	"SELECT
	|	TT_Activities.Activity AS Activity,
	|	TT_Activities.CostPool AS CostPool,
	|	CostPools.CostDriver AS CostDriver,
	|	AccountingPolicy.ManufacturingOverheadsAllocationMethod AS OverheadsMethod
	|INTO TT_ActivitiesParameters
	|FROM
	|	TT_Activities AS TT_Activities
	|		LEFT JOIN Catalog.CostPools AS CostPools
	|		ON TT_Activities.CostPool = CostPools.Ref,
	|	InformationRegister.AccountingPolicy.SliceLast(&Date, Company = &Company) AS AccountingPolicy
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	OverheadRates.Owner AS Owner,
	|	OverheadRates.CostDriver AS CostDriver,
	|	OverheadRates.ExpenseItem AS ExpenseItem,
	|	OverheadRates.OverheadsGLAccount AS OverheadsGLAccount,
	|	OverheadRates.BusinessUnit AS BusinessUnit,
	|	OverheadRates.Rate AS Rate
	|INTO TT_OverheadRates
	|FROM
	|	InformationRegister.PredeterminedOverheadRates.SliceLast(&Date, Company = &Company) AS OverheadRates
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	TT_ActivitiesParameters.Activity AS Activity,
	|	TT_OverheadRates.ExpenseItem AS ExpenseItem,
	|	TT_OverheadRates.OverheadsGLAccount AS OverheadsGLAccount,
	|	TT_OverheadRates.BusinessUnit AS BusinessUnit,
	|	TT_OverheadRates.Rate AS Rate
	|INTO TT_ActivitiesOverheadRatesAllBusinessUnits
	|FROM
	|	TT_ActivitiesParameters AS TT_ActivitiesParameters
	|		INNER JOIN TT_OverheadRates AS TT_OverheadRates
	|		ON TT_ActivitiesParameters.CostDriver = TT_OverheadRates.CostDriver
	|WHERE
	|	TT_ActivitiesParameters.OverheadsMethod = VALUE(Enum.ManufacturingOverheadsAllocationMethods.PlantwideAllocation)
	|	AND TT_OverheadRates.Owner = &Company
	|	AND (TT_OverheadRates.BusinessUnit = &BusinessUnit
	|			OR TT_OverheadRates.BusinessUnit = VALUE(Catalog.BusinessUnits.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT
	|	TT_ActivitiesParameters.Activity,
	|	TT_OverheadRates.ExpenseItem,
	|	TT_OverheadRates.OverheadsGLAccount,
	|	TT_OverheadRates.BusinessUnit,
	|	TT_OverheadRates.Rate
	|FROM
	|	TT_ActivitiesParameters AS TT_ActivitiesParameters
	|		INNER JOIN TT_OverheadRates AS TT_OverheadRates
	|		ON TT_ActivitiesParameters.CostDriver = TT_OverheadRates.CostDriver
	|WHERE
	|	TT_ActivitiesParameters.OverheadsMethod = VALUE(Enum.ManufacturingOverheadsAllocationMethods.DepartmentalAllocation)
	|	AND TT_OverheadRates.Owner = &BusinessUnit
	|	AND (TT_OverheadRates.BusinessUnit = &BusinessUnit
	|			OR TT_OverheadRates.BusinessUnit = VALUE(Catalog.BusinessUnits.EmptyRef))
	|
	|UNION ALL
	|
	|SELECT
	|	TT_ActivitiesParameters.Activity,
	|	TT_OverheadRates.ExpenseItem,
	|	TT_OverheadRates.OverheadsGLAccount,
	|	TT_OverheadRates.BusinessUnit,
	|	TT_OverheadRates.Rate
	|FROM
	|	TT_ActivitiesParameters AS TT_ActivitiesParameters
	|		INNER JOIN TT_OverheadRates AS TT_OverheadRates
	|		ON TT_ActivitiesParameters.CostPool = TT_OverheadRates.Owner
	|			AND TT_ActivitiesParameters.CostDriver = TT_OverheadRates.CostDriver
	|WHERE
	|	TT_ActivitiesParameters.OverheadsMethod = VALUE(Enum.ManufacturingOverheadsAllocationMethods.ActivityBasedCosting)
	|	AND (TT_OverheadRates.BusinessUnit = &BusinessUnit
	|			OR TT_OverheadRates.BusinessUnit = VALUE(Catalog.BusinessUnits.EmptyRef))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	TT_ActivitiesOverheadRatesAllBusinessUnits.Activity AS Activity,
	|	MAX(TT_ActivitiesOverheadRatesAllBusinessUnits.BusinessUnit) AS BusinessUnit
	|INTO TT_ActivitiesBusinessUnit
	|FROM
	|	TT_ActivitiesOverheadRatesAllBusinessUnits AS TT_ActivitiesOverheadRatesAllBusinessUnits
	|
	|GROUP BY
	|	TT_ActivitiesOverheadRatesAllBusinessUnits.Activity
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	TT_ActivitiesOverheadRatesAllBusinessUnits.Activity AS Activity,
	|	TT_ActivitiesOverheadRatesAllBusinessUnits.ExpenseItem AS ExpenseItem,
	|	TT_ActivitiesOverheadRatesAllBusinessUnits.OverheadsGLAccount AS OverheadsGLAccount,
	|	TT_ActivitiesOverheadRatesAllBusinessUnits.BusinessUnit AS BusinessUnit,
	|	TT_ActivitiesOverheadRatesAllBusinessUnits.Rate AS Rate
	|INTO TT_ActivitiesOverheadRates
	|FROM
	|	TT_ActivitiesOverheadRatesAllBusinessUnits AS TT_ActivitiesOverheadRatesAllBusinessUnits
	|		INNER JOIN TT_ActivitiesBusinessUnit AS TT_ActivitiesBusinessUnit
	|		ON TT_ActivitiesOverheadRatesAllBusinessUnits.Activity = TT_ActivitiesBusinessUnit.Activity
	|			AND TT_ActivitiesOverheadRatesAllBusinessUnits.BusinessUnit = TT_ActivitiesBusinessUnit.BusinessUnit
	|
	|GROUP BY
	|	TT_ActivitiesOverheadRatesAllBusinessUnits.Activity,
	|	TT_ActivitiesOverheadRatesAllBusinessUnits.ExpenseItem,
	|	TT_ActivitiesOverheadRatesAllBusinessUnits.OverheadsGLAccount,
	|	TT_ActivitiesOverheadRatesAllBusinessUnits.BusinessUnit,
	|	TT_ActivitiesOverheadRatesAllBusinessUnits.Rate";
	
EndFunction

#EndRegion

#EndIf
